package by.epam.unit02.main;
// папку bin не нужно коммитить, если ты представляешь исходный код
public class Task01 {

	public static void main(String[] args) {
		
		//Найдите значение функции: z = (a – 3 ) * b / 2 + c.
		
		double a = 5;
		double b = 8;
		double c = 4;
		double z;
		
		z = (a - 3) * b / 2 + c;
		System.out.println("z = " + z);
		
	}	
}
